<img src="images/usm.jpg" width="480" height="240" align="left"/>

# MAT281 - Laboratorio N°03

## Objetivos de la clase

* Reforzar los conceptos básicos de pandas.

## Contenidos

* [Problema 01](#p1)

## Problema 01


<img src="https://imagenes.universia.net/gc/net/images/practicas-empleo/p/pr/pro/profesiones-con-el-avance-de-la-tecnologia.jpg" width="480" height="360" align="center"/>


EL conjunto de datos se denomina `ocupation.csv`, el cual contiene información tal como: edad ,sexo, profesión, etc.

Lo primero es cargar el conjunto de datos y ver las primeras filas que lo componen:

In [1]:
import pandas as pd
import os

In [5]:
# cargar datos
df = pd.read_csv(os.path.join("data","ocupation.csv"), sep="|").set_index('user_id')
df.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

El objetivo es tratar de obtener la mayor información posible de este conjunto de datos. Para cumplir este objetivo debe resolver las siguientes problemáticas:

1. ¿Cuál es el número de observaciones en el conjunto de datos?

In [6]:
df.tail()

         age gender     occupation zip_code
user_id
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [23]:
print("número de filas o cantidad de observaciones")
df.shape[0]

número de filas o cantidad de observaciones

943

Al menos, estas son 2 maneras de ver cuantos datos hay. En .tail sirve si estan ordenados o indexados según user_id, en el segugundo caso vemos la dimensión del objeto.

2. ¿Cuál es el número de columnas en el conjunto de datos?

Con .head() vemos que hay 5 columnas y también con .shape se puede ver, pero de otra forma con .dtypes:

In [17]:
df.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [24]:
print("número de columnas")
df.shape[1]

número de columnas

4

3. Imprime el nombre de todas las columnas

In [37]:
df.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

4. Imprima el índice del dataframe

In [39]:
df.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

5. ¿Cuál es el tipo de datos de cada columna?

In [51]:
for tipo in df.dtypes:
    print(tipo)

int64
object
object
object

6. Resumir el conjunto de datos

In [53]:
df.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

7. Resume conjunto de datos  con todas las columnas

In [55]:
df.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

8. Imprimir solo la columna de **occupation**.

In [57]:
df['occupation'].head()

user_id
1    technician
2         other
3        writer
4    technician
5         other
Name: occupation, dtype: object

9. ¿Cuántas ocupaciones diferentes hay en este conjunto de datos?

In [73]:
print(len(df['occupation'].unique()))
df['occupation'].unique()

21

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

Hay 21 ocupaciones incluídas las "ocupaciones" : 'other' y 'none'.

10. ¿Cuál es la ocupación más frecuente?

no entendí bien como realizarlo con el ejemplo que hay sobre los datos de NBA pero encontre un comando que lo hace solo.

In [103]:
#ocupaciones = df['occupation'].unique()
#n_occ = pd.Series()
#for ocupacion in ocupaciones:
#    df_aux = df.loc[lambda x: x['occupation'] == ocupacion]
#    n_occ.loc[ocupacion] += 1
df['occupation'].value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
salesman          12
lawyer            12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

11. ¿Cuál es la edad media de los usuarios?

In [76]:
df['age'].mean()

34.05196182396607

12. ¿Cuál es la edad con menos ocurrencia?

In [111]:
df['age'].value_counts().tail(6)

62    2
11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64

una manera poco ortodoxa pero para el caso particular funciona. Vemos que las edades 11,10,73,66 y 7 tienen solo una ocurrencia.